// js/locales/ru.js

/**
 * Russian localization strings.
 * @type {Object.<string, string>}
 */
export default {
    "hero.title": "Привет, я <span>{name}</span>",
    "hero.subtitle": "Python разработчик днем & Бетмен ночью",
    "about.title": "Обо мне",
    "about.text1": "Я Python-разработчик с широким техническим спектром – от написания парсеров и интеллектуальных ботов до создания полноценных веб-приложений. Мой стек включает Python (Flask, Django), HTML, CSS, JavaScript, а также работу с SQL и PostgreSQL базами данных. Мне нравится быть универсальным солдатом в мире разработки – могу погрузиться в бэкенд, настроить фронтенд или автоматизировать процессы скрапинга.",
    "about.text2": "Мое увлечение программированием выходит за рамки веба. Я активно занимаюсь анализом данных, превращая сырые массивы в понятную информацию, и постоянно ищу способы оптимизировать рабочие процессы с помощью кода. Верю, что разнообразие задач и технологий делает разработчика по-настоящему ценным, и поэтому я всегда открыт для новых вызовов, будь то сложный алгоритм или красивый пользовательский интерфейс.",
    "about.text3": "Меня мотивируют проекты, которые позволяют совместить аналитический подход с творческим решением задач. Я постоянно учусь, следуя последним трендам в технологиях, и верю, что хороший код – это результат не только логики, но и вдохновения, подкрепленного отличным саундтреком. ",
    "about.text4": "...Влюблен в Софию Ротару...",
    "skills.title": "Навыки",
    "skills.python": "Python",
    "skills.api": "API Development",
    "skills.flask_django": "Flask/Django",
    "skills.data_science": "Data Science",
    "skills.sql_nosql": "SQL/PostgreSQL",
    "skills.html_css": "HTML/CSS",
    "skills.javascript": "JavaScript",
    "skills.bots": "Bots",
    "stats.title": "Статистика",
    "stats.errors": "Ошибок",
    "stats.years_experience": "Лет опыта",
    "stats.coffee_cups": "Кружек кофе",
    "terminal.about_me": "Python разработчик с опытом в веб-разработке и скриптах",
    "projects.title": "Проекты",
    "projects.github_guardion.title": "GitHub сканер",
    "projects.github_guardion.description": "Инструмент безопасности для сканирования публичных репозиториев GitHub на наличие конфидециальных данных, таких как API-токены и приватные ключи, предтвращая случайные утечки",
    "projects.house_price.title": "Предсказатель цен на дома в Калифорнии",
    "projects.house_price.description": "Веб-приложение, использующее машинное обучение для прогнозирования цен на дома в Калифорнии на основе различных характеристик недвижимости",
    "projects.cyber_echo.title": "Голосовой ИИ-ассистент для Arch Linux",
    "projects.cyber_echo.description": "Персональный проект для Arch Linux, обеспечивающий бесшовное голосовое взаимодействие в вашей среде с использованием возможностей ИИ",
    "projects.sniffle.title": "Sniffle",
    "projects.sniffle.description": "Мощный и удобный набор инструментов для Open-Source Intelligence (OSINT), делающий сбор и анализ данных быстрым и доступным",
    "projects.view_github": "Посмотреть на GitHub",
    "contact.title": "Связаться со мной",
    "contact.text": "Готов обсудить ваш следующий проект или просто поговорить о технологиях",
};